Revit 2024 API
BuiltInFailures.RebarFailures.MaxHookExtensionMultiplierWarn Property
 The allowable range of values for the Rebar Hook Extension Multiplier is from 0.01 to 99.0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MaxHookExtensionMultiplierWarn { get; }
Visual Basic
Public Shared ReadOnly Property MaxHookExtensionMultiplierWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MaxHookExtensionMultiplierWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace